precursor_kOmegaUltraFine/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    freeSurface
    {
        type            patch;
        nFaces          90;
        startFace       8442;
    }
    inlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          1080;
        startFace       8532;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet;
    }
    outlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          1080;
        startFace       9612;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet;
    }
    sidewalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          216;
        startFace       10692;
    }
    noSlipWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          90;
        startFace       10908;
    }
)

// ************************************************************************* //
