precursor_kOmegaUltraFine/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
3240
(
(0.0180675 -5.33289e-11 1.6988e-11)
(0.0180674 3.50641e-10 -3.61713e-11)
(0.0180676 -3.03469e-10 1.85617e-11)
(0.043754 1.24184e-10 7.15228e-11)
(0.0437541 3.34547e-09 -1.35559e-10)
(0.0437551 -3.46706e-09 6.40967e-11)
(0.0505712 2.73301e-09 8.91281e-11)
(0.050572 -1.4678e-10 -1.75276e-10)
...
)
;

boundaryField
{
    freeSurface
    {
        type            slip;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    sidewalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    noSlipWalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
