precursor_kOmegaUltraFine/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
3240
(
8.36434e-06
8.36417e-06
8.3645e-06
2.22951e-05
2.22951e-05
2.22968e-05
3.14623e-05
3.14633e-05
...
)
;

boundaryField
{
    freeSurface
    {
        type            slip;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    sidewalls
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
216
(
4.46179e-06
5.90017e-05
0.000105191
0.000105191
0.000144462
0.000180873
0.000215979
0.000250069
...
)
;
    }
    noSlipWalls
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
90
(
4.46179e-06
8.69943e-06
1.29662e-05
1.77125e-05
2.25744e-05
2.74877e-05
3.24259e-05
3.73731e-05
...
)
;
    }
}


// ************************************************************************* //
