precursor_kOmegaUltraFine/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
3240
(
686.843
686.845
686.843
1389.14
1389.14
1389.14
1392.55
1392.56
...
)
;

boundaryField
{
    freeSurface
    {
        type            slip;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    sidewalls
    {
        type            omegaWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
        blended         false;
        value           nonuniform List<scalar> 
216
(
736.722
5.89632
7.87298
7.87298
9.22628
10.3237
11.2812
12.1389
...
)
;
    }
    noSlipWalls
    {
        type            omegaWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
        blended         false;
        value           nonuniform List<scalar> 
90
(
736.722
1471.07
1471.07
1471.07
1471.07
1471.07
1471.07
1471.07
...
)
;
    }
}


// ************************************************************************* //
